Day-3/demo-temperature-diffusion-simulation/case_1D_diffusion/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2306                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 350;

boundaryField
{
    leftWall
    {
        type            fixedValue;
        value           uniform 300;
    }
    rightWall
    {
        type            fixedValue;
        value           uniform 273;
    }
    sides
    {
        type            empty;
    }
}


// ************************************************************************* //
